-- ---------------------------------------
-- orange-module-system-info 服务预置数据
-- ---------------------------------------
use orange;

-- 默认用户ID
SET @u_id := -100;

-- 默认租户ID
SET @t_id := -100;

-- ------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--   系统数据状态-sys_common_data_status type ID范围 [1]  data ID范围 [100 - 200）
-- ------------------------------------------------------------------------------------------------------------------------------------------------------------------------
BEGIN;
-- 新增字典类型
INSERT INTO sys_dict_type (id, tenant_id, name, dict_type, status, preset_flag, remark, created_by, created_at, updated_by, updated_at)
VALUES (1, @t_id, '系统数据状态', 'sys_common_data_status', 0, 0, '系统中数据状态', @u_id, NOW(), @u_id, NOW());
